hoshinoht/forest-link-protocol/flp-node/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"

# PSRAM — ESP32-S3FH4R2 has 2MB Quad-SPI PSRAM
# Use MEMMAP mode: PSRAM is mapped but NOT added to heap automatically.
# We manually add it to heap after WiFi init to avoid heap corruption
# during WiFi PHY calibration (known ESP-IDF issue on chip rev v0.2).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_MEMTEST=n

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=0
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_SPI_FLASH_ROM_IMPL=y
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FLP_OLED_ENABLED=y
CONFIG_FLP_OLED_SDA=18
CONFIG_FLP_OLED_SCL=17
CONFIG_FLP_OLED_RST=-1
CONFIG_FLP_DEMO_AUTO=y
CONFIG_FLP_DEMO_AUTO_INTERVAL_S=60

# IMPORTANT NOTE: As this is a prototype we will be hardcoding the Wi-Fi credentials for simplicity.
# In a production system, you would want to implement a more secure and flexible way of configuring
# Wi-Fi credentials (e.g., via a web interface, Bluetooth, or a mobile app

# Please change the following Wi-Fi credentials to your own Wi-Fi network before
# building and flashing the firmware.
CONFIG_FLP_WIFI_SSID="hoshiyomi"
CONFIG_FLP_WIFI_PASSWORD="Kiseki033171"


# Mqtt gateway
CONFIG_FLP_MQTT_BROKER_URI="mqtt://10.239.233.64"
